# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv5s-Ghost-CA-WIoU: Enhanced with Ghost modules, Coordinate Attention, and WIoU loss
# Parameters
nc: 2  # number of classes (safety vest detection)
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23]  # P3/8
  - [30, 61, 62, 45, 59, 119]  # P4/16
  - [116, 90, 156, 198, 373, 326]  # P5/32

# YOLOv5s-Ghost-CA backbone with Coordinate Attention
backbone:
  # [from, number, module, args]
  [
    [-1, 1, GhostConv, [64, 6, 2, 2]],  # 0-P1/2 - Ghost convolution for efficiency
    [-1, 1, GhostConv, [128, 3, 2]],    # 1-P2/4 - Ghost convolution
    [-1, 3, C3Ghost, [128]],             # 2 - Ghost CSP module
    [-1, 1, CoordinateAttention, [64, 64]],  # 3 - CA attention module 1 (64->64 channels)
    [-1, 1, GhostConv, [256, 3, 2]],    # 4-P3/8 - Ghost convolution
    [-1, 6, C3Ghost, [256]],             # 5 - Ghost CSP module
    [-1, 1, CoordinateAttention, [128, 128]],  # 6 - CA attention module 2 (128->128 channels)
    [-1, 1, GhostConv, [512, 3, 2]],    # 7-P4/16 - Ghost convolution
    [-1, 9, C3Ghost, [512]],             # 8 - Ghost CSP module
    [-1, 1, CoordinateAttention, [256, 256]],  # 9 - CA attention module 3 (256->256 channels)
    [-1, 1, GhostConv, [1024, 3, 2]],   # 10-P5/32 - Ghost convolution
    [-1, 3, C3Ghost, [1024]],            # 11 - Ghost CSP module
    [-1, 1, CoordinateAttention, [512, 512]],  # 12 - CA attention module 4 (512->512 channels)
    [-1, 1, SPPF, [1024, 5]],           # 13 - Spatial Pyramid Pooling Fast
  ]

# YOLOv5s-Ghost-CA head with additional CA modules
head:
  [
    [-1, 1, Conv, [512, 1, 1]],         # 14
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 15
    [[-1, 8], 1, Concat, [1]],          # 16 - cat backbone P4
    [-1, 3, C3, [512, False]],          # 17
    [-1, 1, CoordinateAttention, [256, 256]],  # 18 - CA attention module 5 (256->256 channels)

    [-1, 1, Conv, [256, 1, 1]],         # 19
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 20
    [[-1, 5], 1, Concat, [1]],          # 21 - cat backbone P3
    [-1, 3, C3, [256, False]],          # 22 (P3/8-small)
    [-1, 1, CoordinateAttention, [128, 128]],  # 23 - CA attention module 6 (128->128 channels)

    [-1, 1, Conv, [256, 3, 2]],         # 24
    [[-1, 18], 1, Concat, [1]],         # 25 - cat head P4
    [-1, 3, C3, [512, False]],          # 26 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],         # 27
    [[-1, 14], 1, Concat, [1]],         # 28 - cat head P5
    [-1, 3, C3, [1024, False]],         # 29 (P5/32-large)

    [[22, 26, 29], 1, Detect, [nc, anchors]],  # 30 - Detect(P3, P4, P5)
  ]